In [2]:
import pandas as pd
import sqlalchemy as sa

db_url = 'mssql+pyodbc://DESKTOP-VEC8VG9/pandas?driver=SQL+Server'
engine = sa.create_engine(db_url) #write to sql server
connection = engine.connect() #read from sql server

In [3]:
df = pd.read_sql(sa.text('select * from Roster'), con=connection)

In [4]:
df

             Name  Species  Age
0  Benjamin Sisko    Human   40
1        Ezri Dax    Trill  300
2      Kira Nerys  Bajoran   29